{
  "001-tracy-osborn_en": {
    "date": "2016-11-12", 
    "end_time": "10:15:00", 
    "kind": "keynote", 
    "md": "", 
    "pk": 1, 
    "rooms": "TRS 1-067", 
    "speakers": "Tracy Osborn", 
    "start_time": "09:00:00", 
    "title": "Saturday Morning Keynote"
  }, 
  "002-raymond-hettinger_en": {
    "date": "2016-11-12", 
    "end_time": "18:30:00", 
    "kind": "keynote", 
    "md": "", 
    "pk": 2, 
    "rooms": "TRS 1-067", 
    "speakers": "Raymond Hettinger", 
    "start_time": "17:30:00", 
    "title": "Saturday Afternoon keynote"
  }, 
  "003-safia-abdalla_en": {
    "date": "2016-11-13", 
    "end_time": "11:00:00", 
    "kind": "keynote", 
    "md": "", 
    "pk": 3, 
    "rooms": "TRS 1-067", 
    "speakers": "Safia Abdalla", 
    "start_time": "10:00:00", 
    "title": "Sunday Morning keynote"
  }, 
  "004-gary-bernhardt_en": {
    "date": "2016-11-13", 
    "end_time": "18:00:00", 
    "kind": "keynote", 
    "md": "", 
    "pk": 4, 
    "rooms": "TRS 1-067", 
    "speakers": "Gary Bernhardt", 
    "start_time": "17:00:00", 
    "title": "Sunday Afternoon Keynote"
  }, 
  "010-anna-ossowski_en": {
    "date": "2016-11-12", 
    "end_time": "12:20:00", 
    "github": "ossanna16", 
    "kind": "talk", 
    "md": "The scenario: You run into a bug, break your code-then you have to figure out how to fix it. Do you want to learn what to do when your code doesn&#8217;t work? How a rubber duck can help? This talk is for you! I&#8217;ll present debugging strategies, how to prevent frustration, how to become a more confident debugger, and where/how to get help. Breaking things is the first step to learning how to fix them!\n\n## Anna Ossowski Bio\n\nAnna is currently looking for a new people-focused role in tech. She is a former director of the Python Software Foundation, PyCon Open Spaces-Chair, DjangoCon US Communications Chair, and group leader of the PyLadies Remote group. In her free time she loves speaking at conferences and mentoring future speakers. Anna is very passionate about diversity and community outreach and wants to encourage more women to learn programming because it's awesome!", 
    "photo": "anna-ossowski.jpg", 
    "pk": 10, 
    "rooms": "TRS 3-176", 
    "speakers": "Anna Ossowski", 
    "start_time": "11:50:00", 
    "title": "Rub-a-dub rubber duck: don't be afraid to debug!", 
    "twitter": "ossanna16"
  }, 
  "016-albert-oconnor_en": {
    "date": "2016-11-12", 
    "end_time": "11:00:00", 
    "github": "albertoconnor", 
    "kind": "talk", 
    "md": "Channels is the most exciting thing to happen to Django since, well, Django! It is both an elegant and backwards compatible extension of the core Django request response model to allow direct support of WebSockets and lightweight async tasks. This talk will cover the current state of Channels, work through an asynchronous task example, touch on deployment and point towards other resources.\n\n## Albert O'Connor Bio\n\nFreelance Django developer with over 5 years over independent contracting for business, startups and institutions. Instigator including WatPy the Waterloo Region Python Users Group.", 
    "photo": "albert-oconnor.jpg", 
    "pk": 16, 
    "rooms": "TRS 3-176", 
    "speakers": "Albert O'Connor", 
    "start_time": "10:30:00", 
    "title": "Async tasks with Django Channels", 
    "twitter": "amjoconn"
  }, 
  "018-andrey-petrov_en": {
    "date": "2016-11-12", 
    "end_time": "11:00:00", 
    "github": "shazow", 
    "kind": "talk", 
    "md": "Being able to run C code from Python is pretty great, but what about running Go code from Python? Or even Python from Go? This talk will walk through the process of executing calls between Python and Go using CFFI bindings to bridge the two runtimes and beyond.\n\n## Andrey Petrov Bio\n\nI write a lot of open source software. My most popular projects are [urllib3](https://github.com/shazow/urllib3) and [ssh-chat](https://github.com/shazow/ssh-chat).\n\nI like room-scale virtual reality, linux, and p2p systems. I'm a Y-Combinator alumni and Xoogler. I am a Cat person.", 
    "pk": 18, 
    "rooms": "TRS 1-067", 
    "speakers": "Andrey Petrov", 
    "start_time": "10:30:00", 
    "title": "See Python, See Python Go, Go Python Go", 
    "twitter": "shazow"
  }, 
  "019-roberto-rocha_en": {
    "date": "2016-11-12", 
    "end_time": "11:40:00", 
    "github": "robroc", 
    "kind": "talk", 
    "md": "pandas is a powerful data analysis library that can quickly churn insights from datasets, even massive ones. Learn how to get started quickly and see statistical summaries and pivot tables. We'll also see how easy it is to group data by categories and whip up quick exploratory charts so you can see what your data looks like.\n\nTo follow along, attendees will require a laptop with pandas, numpy, matplotlib and Jupyter packages pre-installed. Roberto recommends the [Anaconda data science platform](https://www.continuum.io/downloads) which provides an easy, cross-platform installation of all of these tools.\n\n## Roberto Rocha Bio\n\nRoberto has been a professional journalist for 11 years, and a specialist in data-driven reporting for the last six. He currently practices his craft at the CBC.\n\nHe was bitten by Python when he built his first web scraper and hasn't stopped. He also uses it to crunch data, make charts and maps, and automate tedious newsrooms tasks.\n\nHe's a regular speaker in conferences and will be a part-time professor of data journalism at the University of Ottawa this fall.", 
    "photo": "roberto-rocha.jpg", 
    "pk": 19, 
    "rooms": "Tutorial", 
    "rowspan": "2", 
    "speakers": "Roberto Rocha", 
    "start_time": "10:30:00", 
    "title": "Find the main story in your data with pandas", 
    "twitter": "robroc"
  }, 
  "024-shivkumar-v-iyer_en": {
    "date": "2016-11-12", 
    "end_time": "14:15:00", 
    "kind": "talk", 
    "md": "Simulating large systems with multiple power electronic converters is a challenge due to the non-linear nature of the circuit and the necessity to model the associated control systems with each converter. Python Power Electronics aims to provide a free and open source solution that can be used by both academics and industry professionals.\n\n## Shivkumar V. Iyer Bio\n\nI am a Power Electronics Engineer at a start-up in Kingston, ON that develops solar microinverters. As a power electronics engineer my primary interest is in simulating large electrical systems with multiple power electronic converters. For this purpose, I am developing my own free and open source circuit simulator called Python Power Electronics (http://www.pythonpowerelectronics.com/). This circuit simulator has been developed purely in Python and began with a blog (http://pythonpowerelectronics.blogspot.ca/) and a project hosting on SourceForge (https://sourceforge.net/projects/pythonpowerelec/). The website (http://www.pythonpowerelectronics.com/) now contains all parts of the project including case studies and examples and also documentation on how to use the software. My primary interest lies in simulating power systems with renewable energy systems.", 
    "photo": "shivkumar-v-lyer.jpg", 
    "pk": 24, 
    "rooms": "TRS 3-176", 
    "speakers": "Shivkumar V. Iyer", 
    "start_time": "14:05:00", 
    "title": "Circuit simulator for power electronics: Python power electronics"
  }, 
  "026-david-wolever_en": {
    "date": "2016-11-12", 
    "end_time": "16:30:00", 
    "github": "wolever", 
    "kind": "talk", 
    "md": "Python's fantastic until it isn't.  This talk dives into some of the surprising implementation details of CPython, then explains exactly how they could be discovered from first principles.\n\nAttendees will leave with some dangerous Python trivia, and the tools they'll need to uncovery their own trivia when surprises strike.\n\n## David Wolever Bio", 
    "pk": 26, 
    "rooms": "TRS 3-176", 
    "speakers": "David Wolever", 
    "start_time": "16:00:00", 
    "title": "When the abyss gazes back: staring down Python's surprising internals", 
    "twitter": "wolever"
  }, 
  "039-ankita-mukherjee-k-utham-kumar_en": {
    "date": "2016-11-13", 
    "end_time": "16:10:00", 
    "kind": "talk", 
    "md": "The talk is an introduction about exploit development using Python. It helps to understand the overflows in stack using assembly debuggers and python. The talk will cover basics of zero days and exploit in a very brief way and also armed architecture. It will emphasis more on how python can leverage security professionals by automation of their tasks and even performing DFIR tasks.\n\n## Ankita Mukherjee Bio\n\n* [Twitter](https://twitter.com/ankita7903)\n* [GitHub](https://github.com/ankita0000)\n\nMy name is Ankita Mukherjee, am a full time student and part time infosec researcher. I use python extensively for infosec research and also as an alternative for MATLAB for all my image processing ,data sets projects where my core emphasis is on finding vulnerabilities,bugs in communication networks and also using machine learning techniques for infosec research. Apart from all these activities i am the organizer of Django Girls Delhi and building a community for women where they can share ideas. In my free times i mentor newbies who want to learn code.\n\n## K. Utham Kumar Bio\n\n* [Twitter](https://twitter.com/UtJA11)\n\nOpen Source Enthusiast, Freelancer Working on python for the past 5 years I started coding in matlab and c but during academics I did find python very flexible for all my projects.\n\nAs a day job I mentor students on their projects and provide trainings but my major interest lies in security aspect of machine learning  and also internet privacy.\n\nWith upcoming technologies user privacy has been intruded so working on privacy and security aspect.", 
    "pk": 39, 
    "rooms": "TRS 1-067", 
    "speakers": "Ankita Mukherjee & K. Utham Kumar", 
    "start_time": "15:40:00", 
    "title": "Python for exploit development"
  }, 
  "042-ben-sapiro_en": {
    "date": "2016-11-12", 
    "end_time": "14:15:00", 
    "github": "bsapiro", 
    "kind": "talk", 
    "md": "Security professionals don't have great tools for managing their governance programs (audit, risk, system descriptions, etc.) and typically need to buy very expensive tools or resort to using Excel spreadsheets. G.Tool is an opensource python based framework that uses pyparsing to implement a user DSL and file ORM for building your security governance tools without writing code. \n\n## Ben Sapiro Bio\n\nI am the head of Security at Vision Critical (a SaaS company) and have worked in both infosec consulting and operations since graduated from b-school. I'm a regular contributor on the LiquidMatrix Podcast (whenever we get around to recording it) and helps run BSidesTO.\n\nRecently, I built an internal tool (in Python) at work and it went reasonably well to I decided so I decided to rebuild, from scratch, an open source and generalized version of the tool to help security professionals manage different information processes from audit reporting to risk management and everything in between. \n\nI am not a professional developer but I've dabbled with Python for years. This is my first serious release in Python. Prior to this I released an opensource tool called Binary Risk Analysis.", 
    "photo": "ben-sapiro.jpg", 
    "pk": 42, 
    "rooms": "TRS 1-067", 
    "speakers": "Ben Sapiro", 
    "start_time": "14:05:00", 
    "title": "G.Tool: a Python-based DSL for managing information security governance information", 
    "twitter": "ironfog"
  }, 
  "046-nick-anderegg_en": {
    "date": "2016-11-13", 
    "end_time": "11:40:00", 
    "github": "NickAnderegg", 
    "kind": "talk", 
    "md": "This talk details how a distributed application was used to algorithmically compare pairs of Chinese characters for use in psycholinguistic research. By programmatically representing the structure of Chinese characters, it is possible to quantify the similarity of two characters in the same way it is possible to quantify the similarity of two English words by comparing their constituent letters.\n\n## Nick Anderegg Bio\n\nNick is an MSc student in Cognitive Psychology at Western University, with a primary research area in reading, phonology, and computational psycholinguistics. He earned a BPhil degree in Linguistics and a BA degree in Psychology from Penn State University. He's primarily interested in understanding universal reading processes that speakers of different languages have in common, and how cross-linguistic differences in writing systems and phonology interact with these processes.", 
    "photo": "nick-anderegg.jpg", 
    "pk": 46, 
    "rooms": "TRS 2-166", 
    "speakers": "Nick Anderegg", 
    "start_time": "11:10:00", 
    "title": "Quantifying the visual structure of written language", 
    "twitter": "nickanderegg"
  }, 
  "052-joshua-weissbock_en": {
    "date": "2016-11-13", 
    "end_time": "14:20:00", 
    "kind": "talk", 
    "md": "Python is used across various industries to help solve various problems. Sports Analytics, the systematic analysis of information in the context of various sports is one field where Python is a major contributor in competition with R. In this discussion I outline the most common uses of Python in my work in the National Hockey League to help improve management's decision making.\n\n## Joshua Weissbock Bio\n\nJosh Weissbock works in the federal government by day in Victoria BC. He has been involved in hockey analytics for the past half decade from his early days of public researching in the hockey analytics blogosphere and CanucksArmy.com. He has studied hockey analytics in the context of applications for Machine Learning at the University of Ottawa and is now applying his trade with the Florida Panthers in the National Hockey league.", 
    "pk": 52, 
    "rooms": "TRS 3-176", 
    "speakers": "Joshua Weissbock", 
    "start_time": "14:10:00", 
    "title": "Hockey Night at PyCon", 
    "twitter": "joshweisbock"
  }, 
  "053-tanya-janca_en": {
    "date": "2016-11-12", 
    "end_time": "17:00:00", 
    "kind": "talk", 
    "md": "Everyone knows that the earlier you fix a bug the cheaper and easier it is, this rings true for security bugs as well. This talk will argue that security needs to start in the development phase, and that the power to find most common security issues needs to be put into the developer's hands.\n\nThis talk will include hands on demo of how to find security flaws, how they happen in the first place, and most importantly, how to fix them. If you've written a fast, beautiful application that meets all your requirements but it isn't secure, then it's not the best. This talk will enable you to write the best code possible, by making your code secure.\n\n## Tanya Janca Bio\n\nTanya Janca is an application security evangelist, a web application penetration tester, the Co-Leader of the Ottawa OWASP chapter, and has been developing software since the late 90&#8217;s. She has worn many hats and done many things, including; Custom Apps, Ethical Hacking, COTS, Incident Response and Investigation, Enterprise Architecture, Project and People Management, as well as giving training and doing public speaking. She&#8217;s also the front woman for a cyber-punk band named Zero Day Reapers.", 
    "pk": 53, 
    "rooms": "Tutorial", 
    "rowspan": "2", 
    "speakers": "Tanya Janca", 
    "start_time": "16:00:00", 
    "title": "Introducing security earlier into the SDLC - how to hack your own apps"
  }, 
  "054-greg-wilson_en": {
    "date": "2016-11-13", 
    "end_time": "12:20:00", 
    "github": "gvwilson", 
    "kind": "talk", 
    "md": "There are hundreds of books about compilers, but only three about writing debuggers. Spreadsheets are used more than any other statistical tool, but version control still can't handle them.  Everyone thinks we should teach kids to program, but courses on computing education are almost nonexistent.  This talk explores why these gaps exist and what they tell us about computing today and in future.\n\n## Greg Wilson Bio\n\nGreg Wilson is the co-founder of Software Carpentry, a volunteer organization that teaches basic computing skills to researchers in a wide range of disciplines.  He has worked for 30 years in both industry and academia, and is the author or editor of several books on computing (including the 2008 Jolt Award winner \"Beautiful Code\") and two for children. Greg received a Ph.D. in Computer Science from the University of Edinburgh in 1993.", 
    "photo": "greg-wilson.jpg", 
    "pk": 54, 
    "rooms": "TRS 1-067", 
    "speakers": "Greg Wilson", 
    "start_time": "11:50:00", 
    "title": "Not on the shelves: what nonexistent books, tools, and courses can tell us about ourselves", 
    "twitter": "gvwilson"
  }, 
  "055-juti-noppornpitak_en": {
    "date": "2016-11-12", 
    "end_time": "15:30:00", 
    "github": "shiroyuki", 
    "kind": "talk", 
    "md": "While most people know test-driven development, in reality, not many developers have a luxury of time to implement tests before product delivery due to non-negotiable deadline or competitive business opportunity. This talk will explore how to approach the problem, technical considerations, and some useful design patterns which allows developers to implement maintainable code before writing tests.\n\n## Juti Noppornpitak Bio\n\nI am a software developer, a mathematician, a UX designer, and a photography who is based in Toronto. I am currently with Statflo Inc. as Senior Software Developer.", 
    "pk": 55, 
    "rooms": "TRS 2-166", 
    "speakers": "Juti Noppornpitak", 
    "start_time": "15:00:00", 
    "title": "How to write maintainable code without tests", 
    "twitter": "shiroyuki"
  }, 
  "056-mike-c-fletcher_en": {
    "date": "2016-11-13", 
    "end_time": "12:20:00", 
    "github": "mcfletch", 
    "kind": "talk", 
    "md": "Without mistakes, there is no knowledge. We must make wrong predictions to learn, and we must try the impossible to break out of our complacency. This talk will explore the key role mistakes play in our own minds, our attempts to build AIs, and our practice as programmers. We are going to argue that mistakes are your best friend and offer some guidance on how to make more of them.\n\n## Mike C. Fletcher Bio\n\nMike Fletcher is a design epistemologist (someone who studies the formation of knowledge or belief) by training, currently running a small programming consultancy in Toronto. He has been programming Python since 1995. He is a PSF Fellow and the maintainer of a number of Open Source projects, including PyOpenGL, RunSnakeRun, and OpenGLContext.", 
    "photo": "mike-c-fletcher.jpg", 
    "pk": 56, 
    "rooms": "TRS 2-166", 
    "speakers": "Mike C. Fletcher", 
    "start_time": "11:50:00", 
    "title": "Embrace the mistake", 
    "twitter": "thevrplumber"
  }, 
  "058-sa-friend_en": {
    "date": "2016-11-13", 
    "end_time": "13:00:00", 
    "github": "ana0", 
    "kind": "talk", 
    "md": "A lot of things in the python universe are named after Month Python references - references that we python programmers may not understand, and may not even be able to spot as jokes.  I have collected some of these and will share them with you, for your edification and amusement.\n\n## sa friend Bio\n\nsa friend is a designer and developer currently studying at Recurse Center in NYC. Before that, she was the senior designer and production director at Guild Eyewear,  a start up making mass-customizable glasses.  She is also the founder of Small Talk, an Interdisciplinary Lecture Series.", 
    "photo": "sa-friend.jpg", 
    "pk": 58, 
    "rooms": "TRS 2-166", 
    "speakers": "sa friend", 
    "start_time": "12:30:00", 
    "title": "Monty Python for pythonistas", 
    "twitter": "isthisanart_"
  }, 
  "059-brett-cannon_en": {
    "date": "2016-11-12", 
    "end_time": "16:30:00", 
    "github": "brettcannon", 
    "kind": "talk", 
    "md": "Scheduled for release in mid-December following the conference, Python 3.6 is shaping up to be a feature-packed release! This talk will cover all the new features of note that will be making their debut in Python 3.6, with consideration to explain things so that those still on legacy Python 2 can follow along.\n\n## Brett Cannon Bio\n\nBrett is part of the [Azure](https://azure.microsoft.com/) Data Science Tools team at [Microsoft](https://www.microsoft.com/) where he works on various [Python engineering](https://blogs.msdn.microsoft.com/pythonengineering/) problems. He has been a core developer of Python itself for over 13 years and mucked around with pretty much every part of Python at this point. At this point Brett just hopes he can continue to live up to [winning the 2016 Frank Willison Award](http://pyfound.blogspot.com/2016/05/brett-cannon-wins-frank-willison-award.html).", 
    "pk": 59, 
    "rooms": "TRS 1-067", 
    "speakers": "Brett Cannon", 
    "start_time": "16:00:00", 
    "title": "What's new in Python 3.6", 
    "twitter": "brettsky"
  }, 
  "060-heather-shapiro_en": {
    "date": "2016-11-12", 
    "end_time": "11:40:00", 
    "github": "heatherbshapiro", 
    "kind": "talk", 
    "md": "Put the days of trying to decipher meaning from boring spreadsheets behind you. Visualize data to give greater and immediate meaning to all those numbers with Python. Explore the variety of options available for data visualization in Python using different libraries and understand which ones excel for what type of task. Create maps, statistical graphs and more detailed or interactive visualization\n\n## Heather Shapiro Bio\n\nHeather Shapiro is a Technical Evangelist in Microsoft's Developer Experience group, where she educates developers on Microsoft's new technologies. In this role, Heather works closely with students and developer communities across the North East to understand the newest technologies and architectures. Prior to becoming a Technical Evangelist, Heather completed her undergraduate degree at Duke University and graduated in the Class of 2015. She received Bachelors of Science in Computer Science and Statistical Science, and completed an Honors Thesis about employing Bayesian Approaches to Understanding Music Popularity. Heather blogs at http://microheather.com and tweets at http://twitter.com/microheather.", 
    "photo": "heather-shapiro.jpg", 
    "pk": 60, 
    "rooms": "TRS 3-176", 
    "speakers": "Heather Shapiro", 
    "start_time": "11:10:00", 
    "title": "An end to boring data with visualizations", 
    "twitter": "microheather"
  }, 
  "061-sachin-agarwal_en": {
    "date": "2016-11-12", 
    "end_time": "11:40:00", 
    "github": "sachinkagarwal", 
    "kind": "talk", 
    "md": "Designing a HTTP-RESTful-API-based infrastructure provisioning system is challenging. Concurrent users, race conditions, erroneous OS responses, quota mechanisms etc. need to be wrapped up under a consistent and responsive CRUD interface. The talk is about a few design patterns and about the \"lessons learnt\" in building/operating/iterating a large scale API-driven infra-provisioning system.\n\n## Sachin Agarwal Bio\n\n### In Brief  \n\nPython hacker with a day job in the infra/platform cloud space: devops automation, monitoring, capacity planning, data mining logs, virtualization/LXC-docker containerization, software-defined-* (networking/storage/compute).\n\n### Formal Stuff\n\n#### Current\n\nI work as an engineering manager for a infrastructure/platform software development team at TD @ Waterloo. Shameless plug - I am hiring Python developers, especially those with infra/cloud/config management/devops experience - in  Waterloo.\n\n####  Previous\n\n* Storage architect at blackberry - developer of a large scale software-defined-storage all-flash system: Backend for 1000+ node Cassandra cluster(s).\n* Researcher at NEC Labs (Heidelberg, Germany) and Deutsche Telekom Labs (Berlin, Germany), PhD - Boston University.", 
    "pk": 61, 
    "rooms": "TRS 2-166", 
    "speakers": "Sachin Agarwal", 
    "start_time": "11:10:00", 
    "title": "\"Fabric\"ating RESTful APIs for Linux", 
    "twitter": "sachinkagarwal"
  }, 
  "063-greg-ward_en": {
    "date": "2016-11-12", 
    "end_time": "15:30:00", 
    "github": "gward", 
    "kind": "talk", 
    "md": "Nowadays, everybody uses version control. But until you learn to *misuse* your version control system, you're missing out on ways to minimize developer productivity and pessimize your workflow. I'll show you 12 time-tested worst practices that will set you down the wrong path from Day One.\n\n## Greg Ward Bio\n\nI've been using and creating open source software since before the term \"open source\" was coined, and involved with the Python community since the late nineties. I've written or contributed to several modules in the standard library. And I've been working as a programmer for over 20 years. I don't think I've made every mistake in the book, but I've made a lot of them, and I hope to share some of the things I have learned the hard way and save you the trouble.", 
    "photo": "greg-ward.jpg", 
    "pk": 63, 
    "rooms": "TRS 1-067", 
    "speakers": "Greg Ward", 
    "start_time": "15:00:00", 
    "title": "Version control worst practices", 
    "twitter": "gergdotca"
  }, 
  "064-steven-seguin_en": {
    "date": "2016-11-12", 
    "end_time": "12:20:00", 
    "github": "sseg", 
    "kind": "talk", 
    "md": "What's the real-time web? Can I build it myself? In Python? Of course you can! This talk will help Python web developers learn how to integrate real-time components with their existing web applications using `asyncio` and `aiohttp`.\n\n## Steven Seguin Bio\n\nFull-stack developer at SurveyMonkey in Ottawa working on real-time and collaboration features. Holds strong opinions about distributed systems, functional programming, and API design.", 
    "photo": "steven-seguin.jpg", 
    "pk": 64, 
    "rooms": "TRS 1-067", 
    "speakers": "Steven Seguin", 
    "start_time": "11:50:00", 
    "title": "Building the Real-time Web with Python and aiohttp"
  }, 
  "065-samuel-cormier-iijima_en": {
    "date": "2016-11-12", 
    "end_time": "17:10:00", 
    "github": "sciyoshi", 
    "kind": "talk", 
    "md": "Have you ever wanted lightning-fast code, without the segfaults and tedious boilerplate of C? Then come learn why so many Pythonistas are excited about Rust, a new language from Mozilla. After a short introduction to the language, we'll see how the Rust Python bindings let us easily write elegant, safe, and high-performance extension modules, hassle-free.\n\n## Samuel Cormier-Iijima Bio\n\nSamuel Cormier-Iijima is a senior engineer at SurveyMonkey. He previously co-founded Fluidware, which grew to 80 employees before being acquired in 2014. He is passionate about the web, cryptography, computer science and mathematics, and contributes to a number of Python and Rust open source projects. Samuel lives in Ottawa with his wife and cat and plays the keys in his band, Cloud City.", 
    "pk": 65, 
    "rooms": "TRS 1-067", 
    "speakers": "Samuel Cormier-Iijima", 
    "start_time": "16:40:00", 
    "title": "Polish your Python with Rust", 
    "twitter": "sciyoshi"
  }, 
  "066-yury-selivanov_en": {
    "date": "2016-11-12", 
    "end_time": "11:40:00", 
    "github": "1st1", 
    "kind": "talk", 
    "md": "* Overview of async/await.\n* asyncio and uvloop.\n* Sockets, Protocols or Streams?\n* Learn by example: high-performance PostgreSQL driver.\n\n## Yury Selivanov Bio\n\nYury Selivanov is an avid Python user for the last 10 years. He's a CPython core developer since January 2013. He's one of the main developers behind asyncio, and he authored and implemented PEP 492 (async/await) in 2015.\n\nYury is an entrepreneur and technical leader with many years of experience in software architecture and design. He's a partner at MagicStack, a Toronto-based IT consultancy firm, which he co-founded in 2008.", 
    "pk": 66, 
    "rooms": "TRS 1-067", 
    "speakers": "Yury Selivanov", 
    "start_time": "11:10:00", 
    "title": "High performance networking in Python", 
    "twitter": "1st1"
  }, 
  "067-christopher-ing_en": {
    "date": "2016-11-13", 
    "end_time": "11:40:00", 
    "github": "cing", 
    "kind": "talk", 
    "md": "Have you ever been surprised by sophisticated vocabulary used by some hip-hop artists? With standard data science tools, I search a large corpus of hip-hop lyrics in order to extract rhyming couplets that include uncommon and interesting words. Using curated output from this code, I demonstrate how to automate the creation of short text-based posts for a hip-hop themed \"Word of the Day\" blog.\n\n## Christopher Ing Bio\n\nChris is a PhD student at University of Toronto studying computational biochemistry. He has degrees in computational physics and physics from University of Waterloo. He has converted countless graduate students to Python in the wake of his scientific career, not to mention, he's a minor celebrity on Tumblr.", 
    "photo": "christopher-ing.jpg", 
    "pk": 67, 
    "rooms": "TRS 3-176", 
    "speakers": "Christopher Ing", 
    "start_time": "11:10:00", 
    "title": "Word! Automating a Hip-hop word of the day blog", 
    "twitter": "jsci"
  }, 
  "068-anthony-barker_en": {
    "date": "2016-11-13", 
    "end_time": "16:10:00", 
    "kind": "talk", 
    "md": "A high level presentation which will cover working with the popular public blockchains: Bitcoin, Ethereum and Stellar with python.\n\nThe goal of the presentation is that attendees will understand high level the various popular public blockchains using python and how potentially they could use these in their next application.\n\n## Anthony Barker Bio\n\nAnthony has managed or worked on various projects using python over the past decade and is particularly interested in leveraging python in the financial technology (fintech) space for companies such as Bank of Montreal and National Bank as well as start ups.", 
    "pk": 68, 
    "rooms": "TRS 3-176", 
    "speakers": "Anthony Barker", 
    "start_time": "15:40:00", 
    "title": "Python and the Blockchain"
  }, 
  "069-elissa-shevinsky_en": {
    "date": "2016-11-13", 
    "end_time": "16:50:00", 
    "kind": "talk", 
    "md": "If your company is storing customer information, then it's a safe bet that hackers will try to steal it. What are the best practices for securing your customer data? Covering topics such as encryption, deletion and hiring a CISO, this talk is for developers and entrepreneurs seeking to learn more about best practices for information security.\n\n\n## Elissa Shevinsky Bio\n\nElissa Shevinsky is a serial entrepreneur, author, and privacy activist. She joined her first startup (Geekcorps) in 1999, and most recently worked on the Brave browser.  Shevinsky is currently Managing Director at Kearney Boyle & Associates, where she focusing on fixing one of the most broken parts of technology - recruiting. Shevinsky is also the editor of the critically acclaimed book, \"Lean Out.\"", 
    "photo": "elissa-schevinsky.jpg", 
    "pk": 69, 
    "rooms": "TRS 3-176", 
    "speakers": "Elissa Shevinsky", 
    "start_time": "16:20:00", 
    "title": "Securing Your company's data: encryption, deletion and other best practices", 
    "twitter": "ElissaBeth"
  }, 
  "071-francois-maillet_en": {
    "date": "2016-11-13", 
    "end_time": "16:50:00", 
    "github": "mailletf", 
    "kind": "talk", 
    "md": "In this tutorial, we will build a real-time machine learning web app using Python and MLDB.ai. We will use MLDB's Tensorflow integration to use a deep learning model to embed images in a high dimensional conceptual space, and use that representation as features to do transfer learning. This will allow us to build a real-time image classification endpoint.\n\n## Fran&#231;ois Maillet Bio\n\nFran&#231;ois Maillet is a computer scientist specializing in machine learning. He currently leads the machine learning team at MLDB.ai, a Montreal startup building the Machine Learning Database (MLDB).\n\nHe's the creator of the Epic NHL goal celebration hack with a hue light show and real-time machine learning presented at Pycon Canada 2015. Previously built an audio fingerprinter used by a TV advertisement monitoring company. He also did research at the Universit&#233; de Montr&#233;al applying machine learning to solve problems related to music recommendation, play list generation and track auto-tagging.", 
    "photo": "francois-maillet.jpg", 
    "pk": 71, 
    "rooms": "Tutorial", 
    "rowspan": "2", 
    "speakers": "Fran&#231;ois Maillet", 
    "start_time": "15:40:00", 
    "title": "Building a real-time image classification web app with Python and MLDB.ai", 
    "twitter": "mailletf"
  }, 
  "072-piero-ferrante_en": {
    "date": "2016-11-12", 
    "end_time": "16:30:00", 
    "github": "the-real-pdf", 
    "kind": "talk", 
    "md": "Lending involves risk and in order to be a successful lender at scale that risk needs to be mitigated. We'll be discussing how C2FO has built a suite of risk management tools for underwriting and portfolio management using the PyData ecosystem, rpy2 (for integrating R), and Spyre (for building a simple web application).\n\n## Piero Ferrante Bio\n\nPiero Ferrante is the Director of Data Science at [C2FO](https://c2fo.com/). He and his team are focused on optimizing C2FO&#8217;s capital markets through applied machine learning and the development of quantitative risk management systems. In the past he has applied his expertise in healthcare, telecom, insurance, and mobile advertising at Fortune 500 companies and startups. He holds a M.S. in Predictive Analytics from Northwestern University, a B.S. in Finance and Management Information Systems from the University of Delaware, and is an adjunct professor of Text Analytics at Rockhurst University. Piero also helps organize the [Kansas City Data Science Meetup](http://www.meetup.com/Data-Science-KC/) and advises [Play-it Heath](http://playithealth.com/index.html), a digital health engagement solution, on algorithms and data strategy.", 
    "photo": "piero-ferrante.jpg", 
    "pk": 72, 
    "rooms": "TRS 2-166", 
    "speakers": "Piero Ferrante", 
    "start_time": "16:00:00", 
    "title": "Creating a contemporary lending risk management system using Python", 
    "twitter": "the_real_pdf"
  }, 
  "073-dorian-pula_en": {
    "date": "2016-11-12", 
    "end_time": "14:50:00", 
    "github": "dorianpula", 
    "kind": "talk", 
    "md": "Many of us got our start in programming, by building games and simple apps.  However creating interesting games and UIs in Python was not a simple task especially for multiple platforms.  Kivy, a cross-platform Python UI app framework changes all that.  This talk discusses the journey of working with Kivy to develop a moderately complex strategy game. It also contrasts to using other platforms\n\n## Dorian Pula Bio", 
    "pk": 73, 
    "rooms": "TRS 3-176", 
    "speakers": "Dorian Pula", 
    "start_time": "14:20:00", 
    "title": "The art of writing wargames in Python with Kivy", 
    "twitter": "dorianpula"
  }, 
  "074-anoop-thomas-mathew_en": {
    "date": "2016-11-13", 
    "end_time": "15:10:00", 
    "github": "atmb4u", 
    "kind": "talk", 
    "md": "Most of the time we hear buzzwords like Recurrent Neural Nets, LSTM etc. But don't know what is all that jargon and how or why these things work, This talk will give you a decent introduction to Neural Networks (No boring history lessons or the typical \"neurons in brain\" talk), and will give introduction for a hacker to get started with neural networks.\n\n## Anoop Thomas Mathew Bio\n\nAnoop a.k.a ATM is the Co-Founder and CTO of Profoundis ([Vibe](https://www.vibeapp.co)), a successfully bootstrapped company, got *acquired by [FullContact](http://www.fullcontact.com)*. Leading the development effort for the entire product handling millions of requests every month. Vibe internally uses machine learning for the product to work as intended. Now he works as the Head of Technology, India at __fullcontact.com__.", 
    "photo": "anoop-thomas-mathew.jpg", 
    "pk": 74, 
    "rooms": "TRS 3-176", 
    "speakers": "Anoop Thomas Mathew", 
    "start_time": "14:40:00", 
    "title": "Hacker's guide to Neural Networks", 
    "twitter": "atmb4u"
  }, 
  "076-stephen-childs_en": {
    "date": "2016-11-12", 
    "end_time": "14:00:00", 
    "github": "sechilds", 
    "kind": "talk", 
    "md": "The scientific Python ecosystem has made a Python a great language for data analysis, encouraging readable and expressive code, but data analysts struggle with applying Python test frameworks to their data transformation and analysis code. This talk will give a good starting point: how to compare different versions of tabular data and turn that into automated tests.\n\n## Stephen Childs Bio\n\nStephen Childs has been working with Python for the past three years, primarily using the language for data analysis. Originally from Thunder Bay, Ontario, Stephen has called Toronto, Vancouver, Kitchener-Waterloo, Ottawa home. Currently he works at the University of Calgary as an Institutional Analyst. Stephen uses Python for many aspects of the job, but it's main use is to apply predictive models to university data. Stephen is the founder and one of the organizers of PyData Calgary, which promotes of the use of Python and other Open Source tools for data analysis.", 
    "photo": "stephen-childs.jpg", 
    "pk": 76, 
    "rooms": "TRS 3-176", 
    "speakers": "Stephen Childs", 
    "start_time": "13:50:00", 
    "title": "Automate your data analysis testing", 
    "twitter": "sechilds"
  }, 
  "077-jay-parlar_en": {
    "date": "2016-11-12", 
    "end_time": "11:00:00", 
    "github": "parlarjb", 
    "kind": "talk", 
    "md": "Github's Deployments API allows Github itself to sit in the middle of your deployment pipeline, acting as the glue needed to pull together loosely-coupled deployment tooling. This talk will discuss how the author used Github's Deployments API to connect a chatbot to a custom CI server, allowing for chat-based deploys to a custom Docker-based infrastructure.\n\n## Jay Parlar Bio\n\nJay is a Hamilton-based software developer at Rackspace, working on internal tools to improve the quality of life of his coworkers. He spends his days writing JavaScript and Python, contributing both to front-end and back-end systems.\n\nHe earned his Ph.D. in Software Engineering from McMaster University, where he focused on hard real-time embedded systems and vibration analysis, topics that have little-to-nothing to do with his current job.\n\nOutside of work, Jay spends most of his time with his wife and three kids.", 
    "photo": "jay-parlar.jpg", 
    "pk": 77, 
    "rooms": "TRS 2-166", 
    "speakers": "Jay Parlar", 
    "start_time": "10:30:00", 
    "title": "GitHub's Deployments API: let GitHub be your deployment glue", 
    "twitter": "parlar"
  }, 
  "079-hadrien-david_en": {
    "date": "2016-11-13", 
    "end_time": "16:50:00", 
    "github": "hadrien", 
    "kind": "talk", 
    "md": "For the last 2 years, serverless architecture has become a huge trend. Amazon Lambdas is one of the first function as a service solution which I have used since its early beginning. This talk covers the pain it can be to set up a REST API operating AWS API Gateway & Lambdas, the solutions and practices to overcome it.\n\n## Hadrien David Bio\n\nHadrien is a software engineer at Dialogue.co, and is currently developing a service for better healthcare for Canadians. Member of Montreal Python user group, passionated about team work and open source culture, he spends a lot of time designing software architecture and riding his bicycle whether it rains or snows.", 
    "pk": 79, 
    "rooms": "TRS 1-067", 
    "speakers": "Hadrien David", 
    "start_time": "16:20:00", 
    "title": "Painful serverless", 
    "twitter": "hadr"
  }, 
  "083-wesley-george_en": {
    "date": "2016-11-12", 
    "end_time": "14:50:00", 
    "github": "wxgeorge", 
    "kind": "talk", 
    "md": "The most common understanding of databases stop at persistence and retrieval which leaves the power of the relational database as a compute engine under-appreciated and under-utilized. This talk is an exploration of that computational power, the relationship of this compute engine and the ORM, and how to leverage this power in your applications.\r\n\r\n## Wesley George Bio\r\n\r\nWesley George is Software Engineer operating out of Toronto, San Francisco and Thunder Bay. After spending some time on a path towards a PhD in theoretical computer science, finding an increasing amount of his time, attention and enjoyment being captured by software projects, Wes left academia for industry. A specialist in computer security and cryptography, Wes was an early member at Toronto's Nymi before recently moving to another Toronto tech startup, the financial tech company Clearbanc.\r\n\r\nWes gets excited by challenging problems, clean solutions, power tools, ultimate frisbee, opportunities to teach and mentor, and Python conferences.", 
    "photo": "wesley-george.jpg", 
    "pk": 83, 
    "rooms": "TRS 2-166", 
    "speakers": "Wesley George", 
    "start_time": "14:20:00", 
    "title": "Databases 201: the power of the relational algebra and limits of the ORM", 
    "twitter": "wxalistair"
  }, 
  "085-steve-jackson_en": {
    "date": "2016-11-13", 
    "end_time": "14:05:00", 
    "kind": "talk", 
    "md": "## Steve Jackson Bio\n\nElectrical Engineering, University of Toronto. Bought the MITS Altair 8800 in January 1975. Designed and built S100 computer systems. Our team of 2 wrote a disc operating system, Assembler, Business Basic compiler. CEO of private company for 30 years. Developed and manufactured Cash Register systems for fast food restaurant chains, Movie ticketing systems 1985 - 2005. Currently developing Data Stream Infrastructure (DSI), a new and improved software paradigm, which implements Object Oriented Programming in a way we can live with.", 
    "pk": 85, 
    "rooms": "TRS 3-176", 
    "speakers": "Steve Jackson", 
    "start_time": "13:55:00", 
    "title": "Simple made easy"
  }, 
  "086-brett-cannon_en": {
    "date": "2016-11-13", 
    "end_time": "14:20:00", 
    "github": "brettcannon", 
    "kind": "talk", 
    "md": "Jupyter Notebooks provide a way to do \"literate computing\" where documents contain their own live code and visualizations. And while getting started with notebooks is easy, using cloud-based hosting like Azure Notebooks makes it even easier to get started and share your results. This talk will explain what notebooks are and talk about benefits (and drawbacks) of hosting them in the cloud.\n\n## Brett Cannon Bio\n\nBrett is part of the [Azure](https://azure.microsoft.com/) Data Science Tools team at [Microsoft](https://www.microsoft.com/) where he works on various [Python engineering](https://blogs.msdn.microsoft.com/pythonengineering/) problems. He has been a core developer of Python itself for over 13 years and mucked around with pretty much every part of Python at this point. At this point Brett just hopes he can continue to live up to [winning the 2016 Frank Willison Award](http://pyfound.blogspot.com/2016/05/brett-cannon-wins-frank-willison-award.html).", 
    "pk": 86, 
    "rooms": "TRS 1-067", 
    "speakers": "Brett Cannon", 
    "start_time": "14:10:00", 
    "title": "Jupyter Notebooks in the cloud", 
    "twitter": "brettsky"
  }, 
  "088-andre-r-erler_en": {
    "date": "2016-11-12", 
    "end_time": "13:45:00", 
    "github": "aerler", 
    "kind": "talk", 
    "md": "In many scientific applications it is necessary to run a large number of similar experiments (i.e. ensembles). Using examples from my own research, I will show how an Ensemble container class can be constructed in Python to simplify many of the tedious aspects of performing large sets of numerical experiments or simulations and to easily parallelize batch execution.\n\n## Andre R. Erler Bio\n\nAndre is an early-career researcher in climate modeling and hydrology; that means he runs climate models and hydrological models on high performance computing facilities and analyses their output. He uses primarily uses the scientific software stack in Python for data analysis  and visualization, but also uses Python to manage experiments with large volumes of data (or \"data plumbing\").\n\nAndre is also interested in machine learning and the use of data science techniques in and outside of climate science, and he is somewhat concerned about the state of software development in science.\n\nOpen source software, open science, the environment and sustainable global development are the causes he cares most about.", 
    "photo": "andre-r-erler.jpg", 
    "pk": 88, 
    "rooms": "TRS 3-176", 
    "speakers": "Andre R. Erler", 
    "start_time": "13:35:00", 
    "title": "Managing large ensembles and batch execution with Python"
  }, 
  "089-jean-philippe-caissy_en": {
    "date": "2016-11-12", 
    "end_time": "17:10:00", 
    "github": "jpcaissy", 
    "kind": "talk", 
    "md": "Shopify strives to be an ever moving company. With a strong force of hundreds in the R&D team, the challenges to keep delivering and shipping scaled accordingly.\n\nFrom a manual CLI that only ops could execute just a few years back, to today&#8217;s automatic 180+ deploys a day, this talk will highlight the different tools, processes and integrations used throughout the team that fuels today's scale. \n\n## Jean-Philippe Caissy Bio\n\nJean-Philippe is a senior software developer at Shopify, working in their Montreal's office. For the past 4 years, he helped organized the local Montr&#233;al-Python user group. A seasoned Python and Ruby developer, he likes to talk about scaling problems.", 
    "photo": "jean-philippe-caissy.jpg", 
    "pk": 89, 
    "rooms": "TRS 3-176", 
    "speakers": "Jean-Philippe Caissy", 
    "start_time": "16:40:00", 
    "title": "From idea to production in 20 minutes: engineering at scale", 
    "twitter": "jpcaissy"
  }, 
  "091-michael-mchugh_en": {
    "date": "2016-11-12", 
    "end_time": "17:10:00", 
    "github": "mmchugh", 
    "kind": "talk", 
    "md": "We will explore how seemingly simple functions can be layered together to create complex and feature rich topological maps. Watch as each extra layer introduces more interesting, diverse worlds which can be used as images, in games, or as a playground for the curious.\n\n## Michael McHugh Bio\n\nIntroduced to Python a decade ago, I now work as a lead engineer at Urban Airship. Originally from Southern Ontario, I moved to Portland, Oregon 4 years ago. I use half a dozen languages on a weekly basis, but Python has always been my go to for experimentation and productivity. Owner of untold hundreds of half finished projects, seeing how far I can push an idea is much more exciting to me than seeing something completed.", 
    "pk": 91, 
    "rooms": "TRS 2-166", 
    "speakers": "Michael McHugh", 
    "start_time": "16:40:00", 
    "title": "Make some noise with Python and generate terrain"
  }, 
  "093-stuart-williams_en": {
    "date": "2016-11-12", 
    "end_time": "15:30:00", 
    "kind": "talk", 
    "md": "Names in Python probably cause more subtle confusion than any other feature. Sometimes it's because people think they work just like variables in other languages. Often it's because people don't understand how exactly they work.\n\nThis tutorial, targeted at beginner and intermediate Python developers, will focus on how names and namespaces work in all the major language features that change them.\n\n## Stuart Williams Bio\n\nStuart Williams helps quants and developers in Toronto write better software and write software better.  He has taught Python at University, PyCon, and various companies; and to user groups, high school students, and elementary schoolchildren.", 
    "photo": "stuart-williams.jpg", 
    "pk": 93, 
    "rooms": "Tutorial", 
    "rowspan": "2", 
    "speakers": "Stuart Williams", 
    "start_time": "14:20:00", 
    "title": "They're names, not variables!", 
    "twitter": "ceilous"
  }, 
  "094-ryan-easterbrook_en": {
    "date": "2016-11-13", 
    "end_time": "13:00:00", 
    "github": "rjeaster", 
    "kind": "talk", 
    "md": "In this talk we will explore taking the core concepts of microservices and building them into the architecture of a monolith in an attempt to get the best of both worlds. This approach establishes a pragmatic baseline architecture that can cleanly evolve to distributed microservices when needed.\n\n## Ryan Easterbrook Bio\n\nRyan Easterbrook is a systems engineer specializing in designing and building scalable, resilient, and highly versatile system architectures to support a wide variety of applications from web to mobile. For the past five years he's been working on platforms to support SaaS products at great companies such as EventMobi and Firmex, and before that spent two years at a startup developing the backend for social massively multiplayer online games.", 
    "photo": "ryan-easterbrook.jpg", 
    "pk": 94, 
    "rooms": "TRS 3-176", 
    "speakers": "Ryan Easterbrook", 
    "start_time": "12:30:00", 
    "title": "Pragmatic microservices for the rest of us", 
    "twitter": "rjeasterbrook"
  }, 
  "095-elissa-shevinsky_en": {
    "date": "2016-11-12", 
    "end_time": "15:30:00", 
    "kind": "talk", 
    "md": "Whether it's to serve a diverse customer base or to cultivate a more inclusive office environment, companies are ramping up efforts to hire (and retain) diverse technical candidates. This talk covers best practices for all steps in this process - recruiting, hiring and retaining diverse Python engineers (and their teammates) as well as keeping team dynamics harmonious. \n\n## Elissa Shevinsky Bio\n\nElissa Shevinsky is a serial entrepreneur, author, and privacy activist. She joined her first startup (Geekcorps) in 1999, and most recently worked on the Brave browser.  Shevinsky is currently Managing Director at Kearney Boyle & Associates, where she focusing on fixing one of the most broken parts of technology - recruiting. Shevinsky is also the editor of the critically acclaimed book, \"Lean Out.\"", 
    "photo": "elissa-schevinsky.jpg", 
    "pk": 95, 
    "rooms": "TRS 3-176", 
    "speakers": "Elissa Shevinsky", 
    "start_time": "15:00:00", 
    "title": "Building and managing diverse engineering teams", 
    "twitter": "ElissaBeth"
  }, 
  "096-mike-sukmanowsky_en": {
    "date": "2016-11-13", 
    "end_time": "12:20:00", 
    "github": "msukmanowsky", 
    "kind": "talk", 
    "md": "Imagine writing a Python program that could just as easily process a few gigabytes of data locally or hundreds of petabytes in a distributed cluster without changing a single line of code? Too good to be true? It isn't, it's PySpark! In this tutorial we'll learn how to write PySpark that perform basic analysis and fancy machine learning and can run on your computer or thousands of servers.\n\n## Mike Sukmanowsky Bio\n\nMike is the VP of Product at Parse.ly, a Python-built, analytics company that helps people understand, grow and nurture an audience around digital content.\n\nDon't let the title fool you, in addition to product management, Mike also hacks. In addition to open source contributions, he has spent the last 4.5 years contributing to Parse.ly's front-end API and dashboard products as well as back-end data collection and processing systems. Prior to Parse.ly, Mike led analytics teams at Canadian media companies. He holds a H.BSc in Computer Science from Wilfred Laurier University.", 
    "pk": 96, 
    "rooms": "Tutorial", 
    "rowspan": "2", 
    "speakers": "Mike Sukmanowsky", 
    "start_time": "11:10:00", 
    "title": "From gigabytes to petabytes and beyond with PySpark", 
    "twitter": "msukmanowsky"
  }, 
  "098-james-powell_en": {
    "date": "2016-11-12", 
    "end_time": "14:00:00", 
    "github": "dutc", 
    "kind": "talk", 
    "md": "NumFOCUS is a US 501(c)(3) non-profit that fiscally sponsors almost all of the major tools in the Python data science stack: `jupyter`, `numpy`, `pandas`, `matplotlib`, and more. This short presentation introduces NumFOCUS's mission, how folks can get involved, and how NumFOCUS's major and minor initiatives help support the world of open source scientific computing.\n\n## James Powell Bio\n\nJames is a volunteer at NumFOCUS, the 501(c)3 non-profit that supports and promotes open source in data science, data analytics, and scientific computing. At NumFOCUS, he serves as an office of the board, helping to organize the PyData conference series. He also helps run New York's local python meetup groups, NYC Python and Learn Python NYC, and is a past-chair and current organizer for the New York Python conference, PyGotham.", 
    "pk": 98, 
    "rooms": "TRS 1-067", 
    "speakers": "James Powell", 
    "start_time": "13:50:00", 
    "title": "What is NumFOCUS?", 
    "twitter": "dontusethiscode"
  }, 
  "099-james-powell_en": {
    "date": "2016-11-13", 
    "end_time": "16:50:00", 
    "github": "dutc", 
    "kind": "talk", 
    "md": "So you've heard that the Python interpreter you use is called \"CPython.\" It's written in C! But who cares? Why should you even bother to learn more? Could this ever be helpful? Could it help you debug your code or answer questions about how the language works? Thirty minutes is an awful lot of time to spend saying \"no, just forget about it\"...\n\n## James Powell Bio\n\nJames is a volunteer at NumFOCUS, the 501(c)3 non-profit that supports and promotes open source in data science, data analytics, and scientific computing. At NumFOCUS, he serves as an office of the board, helping to organize the PyData conference series. He also helps run New York's local python meetup groups, NYC Python and Learn Python NYC, and is a past-chair and current organizer for the New York Python conference, PyGotham.", 
    "pk": 99, 
    "rooms": "TRS 2-166", 
    "speakers": "James Powell", 
    "start_time": "16:20:00", 
    "title": "CPython internals: why bother?", 
    "twitter": "dontusethiscode"
  }, 
  "100-brandon-rhodes_en": {
    "date": "2016-11-13", 
    "end_time": "16:10:00", 
    "kind": "talk", 
    "md": "How can Python use Selenium to take command of a web browser and step it through thousands of tests that have to run hundreds of times per day? What anti-patterns emerge when an organization has been maintaining a Selenium test suite for multiple years? At Dropbox, I and my co-workers use Python to deliver test results to hundreds of other engineers. Come learn the lessons we have learned so far!\n\n## Brandon Rhodes Bio\n\nBrandon Rhodes works at Dropbox where he strives to deliver a world-class Python development environment to his fellow Dropboxers. His most popular open source projects are astronomy libraries for Python that he has been maintaining since the late 1990s. He speaks at several Python conferences a year, and in 2016&#8211;2017 is the Chair of the main worldwide PyCon conference as it is held in Portland.", 
    "pk": 100, 
    "rooms": "TRS 2-166", 
    "speakers": "Brandon Rhodes", 
    "start_time": "15:40:00", 
    "title": "Using Python to power Selenium at scale", 
    "twitter": "brandon_rhodes"
  }, 
  "101-en-zyme_en": {
    "date": "2016-11-12", 
    "end_time": "14:50:00", 
    "kind": "talk", 
    "md": "Exponentiation is the gotcha of math operators. Be it square or square root, exp, log, tanh, or the complex roots of unity, \\*\\* has it's work cut out. Ints, floats, fractions, and zero don't play nice with \\*\\*. Precision, accuracy, and performance aspects of Python can be revealed by following \\*\\* thru the interpreter down to the metal.  SciPy, SymPy, and Machine Learners care, shouldn't you?\n\n## en zyme Bio\n\nen zyme has been a coder scientist for decades, traversing meteorology, telecom, biotech, and was into data before it was big.\n\nen zyme is the founder of Ad, Hock & Nimble [ a data consultancy] and of 40th Parallel Python. en zyme can be reached at <en.zyme@40thparallelpython.com> or <enzyme@bu.edu>.", 
    "pk": 101, 
    "rooms": "TRS 1-067", 
    "speakers": "en zyme", 
    "start_time": "14:20:00", 
    "title": "How to make ** less expensive and more expressive", 
    "twitter": "en_zyme"
  }, 
  "104-paul-logston_en": {
    "date": "2016-11-13", 
    "end_time": "15:10:00", 
    "github": "logston", 
    "kind": "talk", 
    "md": "I wanna talk about all the cool things you can do with the dunder methods. \n\n## Paul Logston Bio\n\nWill Complete Later.", 
    "photo": "paul-logston.jpg", 
    "pk": 104, 
    "rooms": "TRS 2-166", 
    "speakers": "Paul Logston", 
    "start_time": "14:40:00", 
    "title": "Living in a land down dunder", 
    "twitter": "PaulLogston"
  }, 
  "105-paul-logston_en": {
    "date": "2016-11-12", 
    "end_time": "13:45:00", 
    "github": "logston", 
    "kind": "talk", 
    "md": "This will be  glorified lightning talk on PyVideo.org and what it needs from the community.\n\n## Paul Logston Bio\n\nWill Complete Later.", 
    "photo": "paul-logston.jpg", 
    "pk": 105, 
    "rooms": "TRS 1-067", 
    "speakers": "Paul Logston", 
    "start_time": "13:35:00", 
    "title": "State of the PyVideo", 
    "twitter": "PaulLogston"
  }, 
  "106-matt-mcgraw_en": {
    "date": "2016-11-13", 
    "end_time": "14:35:00", 
    "github": "mcgraw-bb25", 
    "kind": "talk", 
    "md": "Working with Python in a Windows environment can present some unorthodox challenges.  In one such challenge we'll explore one solution for cases when you want to communicate with a SQL Server database and cannot use pyodbc.  The solution demonstrates how to create a small library in Iron Python which can take advantage of the .NET CLR that is responsible for communicating with SQL Server.\n\n## Matt McGraw Bio\n\nAfter five years of working in corporate finance and business intelligence, Matt has shifted his career focus to software development.  The Python community has played a major role in supporting the transition and now he uses Python to help build enterprise information systems in the automotive industry.", 
    "pk": 106, 
    "rooms": "TRS 1-067", 
    "speakers": "Matt McGraw", 
    "start_time": "14:25:00", 
    "title": "Python -> Iron Python -> SQL Server"
  }, 
  "107-david-kua_en": {
    "date": "2016-11-12", 
    "end_time": "12:20:00", 
    "github": "dkua", 
    "kind": "talk", 
    "md": "Testing is generally seen as a Good Thing&#8482; that one should do. Writing tests that are comprehensive and cover all possibilities however can be time-consuming, hard, or even downright impossible. Property-based testing is one method that can help with this. This talk will introduce the concept of property-based testing and how to do it yourself using the Python library Hypothesis.\n\n## David Kua Bio\n\nDavid recently graduated from the undergraduate computer science program at the University of Toronto and is not currently gainfully employed.\r\nHe has previously organized the Go Toronto meetup, the Canadian University Software Engineering Conference (CUSEC), and is presently an organizer of the Toronto chapter of Papers We Love.", 
    "pk": 107, 
    "rooms": "TRS 2-166", 
    "speakers": "David Kua", 
    "start_time": "11:50:00", 
    "title": "Hypothesis: tests that write themselves", 
    "twitter": "davidkua"
  }, 
  "109-stephane-wirtel_en": {
    "date": "2016-11-13", 
    "end_time": "11:40:00", 
    "github": "matrixise", 
    "kind": "talk", 
    "md": "Contribution to CPython is really funny, you can learn how the language is designed, but you want to know where you should start when you have a patch to provide. In this talk, I will explain the several components of CPython and the architecture, how is the code designed.\n\n## St&#233;phane Wirtel Bio\n\nSt&#233;phane is Belgian software hacker, engaged and dad. Organiser of PythonFOSDEM, @ThePSF Fellow, EuroPython Society Member and Member of Association Francophone de Python and former OpenERP Core Dev (6y). He has received a Community Service Award from the Python Software Foundation.\n\nIf you think distributed, asynchronous and others interesting subjects, he will be happy to discuss with you.", 
    "pk": 109, 
    "rooms": "TRS 1-067", 
    "speakers": "St&#233;phane Wirtel", 
    "start_time": "11:10:00", 
    "title": "Architecture of CPython, the bricks!", 
    "twitter": "matrixise"
  }, 
  "113-allaa-hilal_en": {
    "date": "2016-11-13", 
    "end_time": "12:20:00", 
    "kind": "talk", 
    "md": "Predictive analytics uses statistical and machine learning techniques to provide a best assessment of what will happen in the future. Understanding the future can guide current decisions. This talk will provide a quick guide on using deep learning approaches in building predictive models in python. It will give a brief introduction to predictive models, deep learning, Tensorflow and Thenao.\n\n## Allaa Hilal Bio\n\nAllaa R. Hillal has 10+ years&#8217; experience in Data Intelligence, IoT, and Intelligent systems design. She has a Doctorate degree in Pattern Analysis and Machine Intelligence from the Electrical and Computer Engineering at University of Waterloo. Dr. Hilal has been granted numerous prestigious awards and has also been recognized as one of the most influential women in the M2M and IoT space by the Connected World Magazine. She has always been a big supporter of women in Science Technology and engineering and an active member of women engineering chapter in the University of Waterloo over the past 9 years now. She is also the Champion of Women in Technology peer to peer group in Waterloo and has been working on mentoring young girls and women, of all ages, throughout the past 3 years. She is also an adjunct assistant professor at the University of Waterloo in the pattern analysis and Data Intelligence lab. Currently, she holds the position of Innovation Lead at Intelligent Mechatronic Systems.", 
    "photo": "allaa-hilal.jpg", 
    "pk": 113, 
    "rooms": "TRS 3-176", 
    "speakers": "Allaa Hilal", 
    "start_time": "11:50:00", 
    "title": "Deep learning techniques for predictive analytics using Python: Theano vs TensorFlow", 
    "twitter": "AWomanInTechBl"
  }, 
  "115-sye-van-der-veen_en": {
    "date": "2016-11-13", 
    "end_time": "14:05:00", 
    "github": "syeberman", 
    "kind": "talk", 
    "md": "A thought experiment exploring what a symmetrical type system would look like in Python.  Mutable ints, floats, and strs?  Immutable dicts?  What would they be called, how would they behave, and would they even be useful?\n\n## Sye van der Veen Bio\n\nSenior Software Engineer at Zenreach.  I have been marvelling at the elegance and simplicity of Python code for over 15 years.", 
    "photo": "sye-van-der-veen.jpg", 
    "pk": 115, 
    "rooms": "TRS 1-067", 
    "speakers": "Sye van der Veen", 
    "start_time": "13:55:00", 
    "title": "Mutants and immutants: the missing types", 
    "twitter": "syeberman"
  }, 
  "116-stephen-j-turnbull_en": {
    "date": "2016-11-13", 
    "end_time": "13:00:00", 
    "github": "yaseppochi", 
    "kind": "talk", 
    "md": "Based on interviews with leading developers of Python and with Python, we take a look at how the Python language specification and the reference implementation are developed.   The subcommunity of core developers not only produces a great programming language that's fun to use, but sets the tone for a vibrant, productive, and inclusive community of user-developers.\n\n## Stephen J Turnbull Bio\n\nKnown as the Unwelome Guest on several channels because he professes the Dismal Science of Economics, Steve nonetheless has found a ray of light among the zero-profit theorems: open source software and the communities that develop, support, and use it.  He teaches in Japan, where he learned the virtues of Unicode from living in an environment with 5 different encodings (and many nonstandard variants) in use for the same language.  He was introduced to Python development during the discussion of PEP 263 (which appropriately enough allows you to be explicit about encoding of Python programs), when he was turned into a newt by none other than GvR for the sin of misusing the word \"pythonic\".  (It got better!)  He mentors in GSoC for Systers & GNU Mailman, and spends what's left of his free time fighting DMARC to make the Internet safe for mailing lists again.  He's also been know to write Emacs Lisp (ssh! it's a dirty secret!)", 
    "photo": "stephen-j-turnbull.jpg", 
    "pk": 116, 
    "rooms": "TRS 1-067", 
    "speakers": "Stephen J Turnbull", 
    "start_time": "12:30:00", 
    "title": "Where we came from, what's special about now, and where we might go", 
    "twitter": "yasegumi"
  }, 
  "117-daniel-snider_en": {
    "audience_level": "Intermediate", 
    "date": "2016-11-12", 
    "end_time": "13:45:00", 
    "github": "danielsnider", 
    "kind": "talk", 
    "md": "Lets clear the air about witchcraft and best practices in data center IT. Come listen to my rants and raves about OpenStack, the software that controls large armies of compute, storage, and networking resources. Why does OpenStack get so much hype and so much hate?\n\n## Daniel Snider Bio\n\nDaniel Snider is a former OpenStack software engineer, UOIT undergraduate in Information Technology, IBM, and Google Summer of Code student. He is currently a bio-tech newbie at SickKids and roboticist at Ryerson University's R3 Robotics club.", 
    "photo": "daniel-snider.jpg", 
    "pk": 116, 
    "rooms": "2-166", 
    "speakers": "Daniel Snider", 
    "start_time": "13:35:00", 
    "title": "What kind of sorcery is OpenStack?"
  }, 
  "500-eric-evenchick_en": {
    "date": "2016-11-12", 
    "end_time": "14:00:00", 
    "kind": "talk", 
    "md": "Modern cars are basically networks of computers, which control everything from the engine to the airbags. We'll briefly cover how vehicle networks work, then demonstrate how to access to the network using Python and open-source hardware. Finally, we'll discuss some attacks that can be performed on these systems.", 
    "pk": 500, 
    "rooms": "TRS 2-166", 
    "speakers": "Eric Evenchick", 
    "start_time": "13:50:00", 
    "title": "Hacking Cars with Python"
  }, 
  "501-capital-one_en": {
    "date": "2016-11-13", 
    "end_time": "15:10:00", 
    "kind": "tutorial", 
    "md": "Tesseract is an amazing library for doing Optical Character Recognition on printed text. In this tutorial learn how to get started with (Tesseract and Flask libraries) and integrate them for creating a simple web application. We will also see how easy it is to customize the Tesseract library for different cases.", 
    "pk": 501, 
    "rooms": "Tutorial", 
    "rowspan": "2", 
    "speakers": "CapitalOne", 
    "start_time": "13:55:00", 
    "title": "Building a web application for OCR (Optical Character Recognition)"
  }, 
  "502-sarah-wells_en": {
    "date": "2016-11-13", 
    "end_time": "15:10:00", 
    "kind": "talk", 
    "md": "Believing in your dreams is one of the most important steps you'll take in goal setting. While many of us can come up with things we want to accomplish, it is the emotional connection we make with the dream by believing in its possibility that lead us to action and accomplishments. For Olympian Sarah Wells, this belief was mandatory to fuel her Olympic dream after a devastating stress fracture in her leg threatened her chance of making the team. Sarah's story is one of guts, courage and perseverance. Audiences will leave inspired to dream big, overcome obstacles and of course believe!\n\n## Sarah Wells Bio\n\nSarah Wells is a Canadian Olympian specializing in the 400m hurdles. Recruited by her high school teacher, Sarah fell in love with the sport of track and 15 years old and field and joined the Toronto Track club in 2005. With only 8 months of training under her belt, Sarah qualified for her first national team and travelled to Morocco Marrakesh to represent Canada. Since then Sarah has been a 4-time National Champion and a&#160;7-time National Team member.&#160;In 2012, after winning the Canadian National Championships for the 3rd&#160;time in her career, Sarah represented Canada in the London Olympics and finished as an Olympic Semi Finalist. Following the Olympics, Sarah continued progressing and came home a double-medallist from the 2015 Pan-American games held in her home city of Toronto. Sarah has overcome many obstacles in her career and has set her sights on becoming a 2-time Olympian at the 2020 Olympics in Tokyo.", 
    "photo": "sarah-wells.jpg", 
    "pk": 502, 
    "rooms": "TRS 1-067", 
    "speakers": "Sarah Wells", 
    "start_time": "14:40:00", 
    "title": "Overcoming life's hurdles", 
    "twitter": "SarahWells400mh"
  }, 
  "503-lightning-talks_en": {
    "date": "2016-11-13", 
    "end_time": "14:40:00", 
    "kind": "lightning", 
    "md": "", 
    "pk": 503, 
    "rooms": "TRS 2-166", 
    "rowspan": "3", 
    "start_time": "13:55:00", 
    "title": "Lightning Talks"
  }
}